In [3]:
import pandas as pd
import numpy as np

##### **Set 1 - 1**

In [6]:
df = pd.DataFrame(np.arange(10))
df

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

##### **Set 1 - 2**

In [14]:
print("Mean: ", float(df.mean()), "\nStd: ", float(df.std()))

Mean:  4.5
Std:  3.0276503540974917

##### **Set 1 - 3**

In [20]:
print("Min: ", float(df.min()), "\nMax: ", float(df.max()), "\n25%: ", float(df.quantile(.25)), "\n75%: ", float(df.quantile(.75)))

Min:  0.0
Max:  9.0
25%:  2.25
75%:  6.75

##### **Set 2 - 1**

In [33]:
data = {
        "state": ['NY','TX','FL','AL', 'AK','TX','TX'],
        "color": ['blue','green','red','white','gray','black','red'],
        "food": ['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
        "age": [30, 2, 12, 4, 32, 33, 69],
        "height": [165, 70, 120, 80, 180, 172, 150],
        "score": [4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2]
        }
df2 = pd.DataFrame(data, index = ['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])

In [35]:
df2

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

##### **Set 2 - 2**

In [37]:
df2.head(3)

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

##### **Set 2 - 3**

In [38]:
df2.tail(3)

          state  color    food  age  height  score
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

##### **Set 2 - 4**

In [48]:
print("Rows: ", df2.shape[0], "\nColumns: ", df2.shape[1])

Rows:  7
Columns:  6

##### **Set 2 - 5**

In [50]:
df2.describe()

             age      height     score
count   7.000000    7.000000  7.000000
mean   26.000000  133.857143  5.528571
std    23.115651   44.693134  3.324512
min     2.000000   70.000000  1.800000
25%     8.000000  100.000000  2.750000
50%    30.000000  150.000000  4.600000
75%    32.500000  168.500000  8.650000
max    69.000000  180.000000  9.500000

##### **Set 2 - 6**

In [72]:
df2.loc[:,['state','score']]

          state  score
Jane         NY    4.6
Niko         TX    8.3
Aaron        FL    9.0
Penelope     AL    3.3
Dean         AK    1.8
Christina    TX    9.5
Cornelia     TX    2.2

##### **Set 2 - 7**

In [54]:
df2[df2.score >5]

          state  color   food  age  height  score
Niko         TX  green   Lamb    2      70    8.3
Aaron        FL    red  Mango   12     120    9.0
Christina    TX  black  Melon   33     172    9.5

##### **Set 2 - 8**

In [55]:
df2[df2.height < 150]

         state  color   food  age  height  score
Niko        TX  green   Lamb    2      70    8.3
Aaron       FL    red  Mango   12     120    9.0
Penelope    AL  white  Apple    4      80    3.3

##### **Set 2 - 9**

In [56]:
df2[df2.age > 10][df2.age < 40]

/Users/waynsday/PycharmProjects/LBYMF3B/venv/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Aaron        FL    red   Mango   12     120    9.0
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5

##### **Set 2 - 10**

In [57]:
df2[df2.age > 20][df2.score < 5]

/Users/waynsday/PycharmProjects/LBYMF3B/venv/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

         state color    food  age  height  score
Jane        NY  blue   Steak   30     165    4.6
Dean        AK  gray  Cheese   32     180    1.8
Cornelia    TX   red   Beans   69     150    2.2

##### **Set 2 - 11**

In [64]:
df2.sort_index()

          state  color    food  age  height  score
Aaron        FL    red   Mango   12     120    9.0
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2
Dean         AK   gray  Cheese   32     180    1.8
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Penelope     AL  white   Apple    4      80    3.3

##### **Set 2 - 12**

In [65]:
df2.sort_values('score')

          state  color    food  age  height  score
Dean         AK   gray  Cheese   32     180    1.8
Cornelia     TX    red   Beans   69     150    2.2
Penelope     AL  white   Apple    4      80    3.3
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Christina    TX  black   Melon   33     172    9.5

##### **Set 2 - 13**

In [66]:
df2.to_csv('Homework2.csv')